[
    {
      "name": "Google Developer Student Clubs TKMCE",
      "pos": "Creative Head, Design Lead",
      "des": "A community that inspires students to learn and innovate with Google technologies."
    },
    {
      "name": "IEEE SB TKMCE",
      "pos": "Design Head, Design Lead, Second Year Representative",
      "des": "The official IEEE Student Branch promoting technical excellence, research, and professional development."
    },
    {
      "name": "HESTIA'22,23,24",
      "pos": "National Techno Cultural Festival",
      "des": "TKMCE’s premier national techno-cultural fest blending innovation, creativity, and entertainment."
    },
    {
      "name": "Coading Club",
      "pos": "Design",
      "des": "Club for programmers to improve problem-solving skills and collaborate on coding challenges and hackathons."
    },
    {
      "name": "IEI CSE TKMCE",
      "pos": "Web Design",
      "des": "A branch of the Institution of Engineers (India) focusing on advancing computing knowledge and industry interaction."
    },
    {
      "name": "L&D Club TKMCE",
      "pos": "Design",
      "des": "Literary and Debate club focused on fostering literary skills, critical thinking, and public speaking abilities among students."
    },
    {
      "name": "TKM Film Fest",
      "pos": "Design",
      "des": "Annual event that showcases student creativity and filmmaking talent through screenings at TKMCE."
    },
    {
      "name": "AKIASSC'23",
      "pos": "Design",
      "des": "The All Kerala Industry Applications Society Student Conclave of professional and academic minds on technological innovation and excellence."
    },
    {
      "name": "AKSC'23",
      "pos": "Design",
      "des": "All Kerala Students Congress, a state-level platform for student collaboration and technical exchange."
    },
    {
      "name": "ATHENA'24",
      "pos": "Design",
      "des": "flagship technical event by ISTE TKMCE showcasing innovation, creativity, and engineering excellence through competitions and workshops."
    }
  ]